[
  {
    "id": 1,
    "title": "Rendezvous with Rama",
    "description": "Rendezvous with Rama is a science fiction novel by British writer Arthur C. Clarke first published in 1973. Set in the 2130s, the story involves a 50-by-20-kilometre (31 by 12 mi) cylindrical alien starship that enters the Solar System. The story is told from the point of view of a group of human explorers who intercept the ship in an attempt to unlock its mysteries. The novel won both the Hugo[4] and Nebula[5] awards upon its release, and is regarded as one of the cornerstones in Clarke's bibliography. The concept was later extended with several sequels, written by Clarke and Gentry Lee.",
    "pages": 256,
    "published": "1973-6-1",
    "language": "English",
    "country": "United Kingdom",
    "img": "https://upload.wikimedia.org/wikipedia/en/e/e1/Rama_copy.jpg",
    "wikipedia": "https://en.wikipedia.org/wiki/Rendezvous_with_Rama"
  },
  {
    "id": 2,
    "title": "The Left Hand of Darkness",
    "description": "The Left Hand of Darkness is a science fiction novel by U.S. writer Ursula K. Le Guin. Published in 1969, it became immensely popular, and established Le Guin's status as a major author of science fiction.[6] The novel is set in the fictional Hainish universe as part of the Hainish Cycle, a series of novels and short stories by Le Guin, which she introduced in the 1964 short story The Dowry of Angyar. It was fourth in sequence of writing among the Hainish novels, preceded by City of Illusions, and followed by The Word for World Is Forest.[3]",
    "pages": 286,
    "published": "1969-3-1",
    "language": "English",
    "country": "United States",
    "img": "https://upload.wikimedia.org/wikipedia/en/8/88/TheLeftHandOfDarkness1stEd.jpg",
    "wikipedia": "https://en.wikipedia.org/wiki/The_Left_Hand_of_Darkness"
  },
  {
    "id": 3,
    "title": "The Way of Kings",
    "description": "The Way of Kings is an epic fantasy novel written by American author Brandon Sanderson and the first book in The Stormlight Archive series.[2] The novel was published on August 31, 2010, by Tor Books.[3] The Way of Kings consists of one prelude, one prologue, 75 chapters, an epilogue and nine interludes.[4] It was followed by Words of Radiance in 2014,[5][6][7] Oathbringer in 2017 and Rhythm of War in 2020. A leatherbound edition was released in 2021.",
    "pages": 1007,
    "published": "1969-3-1",
    "language": "English",
    "country": "United States",
    "img": "https://upload.wikimedia.org/wikipedia/en/8/8b/TheWayOfKings.png",
    "wikipedia": "https://en.wikipedia.org/wiki/The_Way_of_Kings"
  },
  {
    "id": 4,
    "title": "Children of Time",
    "description": "The work was praised by Financial Times for tackling big themes—gods, messiahs, artificial intelligence, alienness—with brio.",
    "pages": 600,
    "published": "2015-6-1",
    "language": "English",
    "country": "United Kingdom",
    "img": "https://upload.wikimedia.org/wikipedia/en/1/1f/Children_of_Time_%28novel%29.jpg",
    "wikipedia": "https://en.wikipedia.org/wiki/Children_of_Time_(novel)"
  },
  {
    "id": 5,
    "title": "The Stand",
    "description": "The Stand is a post-apocalyptic dark fantasy novel written by American author Stephen King and first published in 1978 by Doubleday. The plot centers on a deadly pandemic of weaponized influenza and its aftermath, in which the few surviving humans gather into factions that are each led by a personification of either good or evil and seem fated to clash with each other. King started writing the story in February 1975,[1] seeking to create an epic in the spirit of The Lord of the Rings. The book was difficult for him to write because of the large number of characters and storylines.",
    "pages": 1153,
    "published": "1978-10-3",
    "language": "English",
    "country": "United Kingdom",
    "img": "https://upload.wikimedia.org/wikipedia/commons/5/52/The_Stand_%281978%29_front_cover%2C_first_edition.png",
    "wikipedia": "https://en.wikipedia.org/wiki/The_Stand"
  },
  {
    "id": 6,
    "title": "The Hobbit",
    "description": "The Hobbit, or There and Back Again is a children's fantasy novel by English author J. R. R. Tolkien. It was published in 1937 to wide critical acclaim, being nominated for the Carnegie Medal and awarded a prize from the New York Herald Tribune for best juvenile fiction. The book is recognized as a classic in children's literature, and is one of the best-selling books of all time with over 100 million copies sold.",
    "pages": 310,
    "published": "1937-9-21",
    "language": "English",
    "country": "United Kingdom",
    "img": "https://upload.wikimedia.org/wikipedia/en/4/4a/TheHobbit_FirstEdition.jpg",
    "wikipedia": "https://en.wikipedia.org/wiki/The_Hobbit"
  },
  {
    "id": 7,
    "title": "The Exorcist",
    "description": "The Exorcist is a 1971 horror novel written by American writer William Peter Blatty and published by Harper & Row. The book details the demonic possession of eleven-year-old Regan MacNeil, the daughter of a famous actress, and the two priests who attempt to exorcise the demon. The novel was the basis of a highly successful film adaptation released two years later, whose screenplay was also written and produced by Blatty. More movies and books were eventually added to The Exorcist franchise.",
    "pages": 340,
    "published": "1971-6-1",
    "language": "English",
    "country": "United States",
    "img": "https://upload.wikimedia.org/wikipedia/en/f/fb/The_Exorcist_1971.jpg",
    "wikipedia": "https://en.wikipedia.org/wiki/The_Exorcist_(novel)"
  },
  {
    "id": 8,
    "title": "The Book Thief",
    "description": "The Book Thief is a historical fiction novel by the Australian author Markus Zusak, set in Nazi Germany during World War II. Published in 2006, The Book Thief became an international bestseller and was translated into 63 languages and sold 17 million copies. It was adapted into the 2013 feature film, The Book Thief.",
    "pages": 584,
    "published": "2006-1-1",
    "language": "English, German",
    "country": "Australia",
    "img": "https://upload.wikimedia.org/wikipedia/en/8/8f/The_Book_Thief_by_Markus_Zusak_book_cover.jpg",
    "wikipedia": "https://en.wikipedia.org/wiki/The_Book_Thief"
  },
  {
    "id": 9,
    "title": "The Da Vinci Code",
    "description": "The Da Vinci Code is a 2003 mystery thriller novel by Dan Brown. It is Brown's second novel to include the character Robert Langdon: the first was his 2000 novel Angels & Demons. The Da Vinci Code follows symbologist Robert Langdon and cryptologist Sophie Neveu after a murder in the Louvre Museum in Paris causes them to become involved in a battle between the Priory of Sion and Opus Dei over the possibility of Jesus Christ and Mary Magdalene having had a child together.",
    "pages": 689,
    "published": "2003-3-18",
    "language": "English",
    "country": "United States",
    "img": "https://upload.wikimedia.org/wikipedia/en/6/6b/DaVinciCode.jpg",
    "wikipedia": "https://en.wikipedia.org/wiki/The_Da_Vinci_Code"
  },
  {
    "id": 10,
    "title": "Cosmos",
    "description": "Cosmos is a popular science book written by astronomer and Pulitzer Prize-winning author Carl Sagan. It was published in 1980 as a companion piece to the PBS mini-series Cosmos: A Personal Voyage with which it was co-developed and intended to complement. Each of the book’s 13 illustrated chapters corresponds to one of the 13 episodes of the television series. Just a few of the ideas explored in Cosmos include the history and mutual development of science and civilization, the nature of the Universe, human and robotic space exploration, the inner workings of the cell and the DNA that controls it, and the dangers and future implications of nuclear war.",
    "pages": 365,
    "published": "1980-1-1",
    "language": "English",
    "country": "United States",
    "img": "https://upload.wikimedia.org/wikipedia/en/9/91/Cosmos_book.gif",
    "wikipedia": "https://en.wikipedia.org/wiki/Cosmos_(Sagan_book)"
  },
  {
    "id": 11,
    "title": "Brave New World",
    "description": "Brave New World is a dystopian novel by English author Aldous Huxley, written in 1931 and published in 1932.[2] Largely set in a futuristic World State, whose citizens are environmentally engineered into an intelligence-based social hierarchy, the novel anticipates huge scientific advancements in reproductive technology, sleep-learning, psychological manipulation and classical conditioning that are combined to make a dystopian society which is challenged by the story's protagonist.",
    "pages": 311,
    "published": "1932-1-1",
    "language": "English",
    "country": "United Kingdom",
    "img": "https://upload.wikimedia.org/wikipedia/en/6/62/BraveNewWorld_FirstEdition.jpg",
    "wikipedia": "https://en.wikipedia.org/wiki/Brave_New_World"
  },
  {
    "id": 12,
    "title": "Salem's Lot",
    "description": "Salem's Lot is a 1975 horror novel by American author Stephen King. It was his second published novel. The story involves a writer named Ben Mears who returns to the town of Jerusalem's Lot (or 'Salem's Lot for short) in Maine, where he lived from the age of five through nine, only to discover that the residents are becoming vampires.",
    "pages": 439,
    "published": "1975-11-17",
    "language": "English",
    "country": "United States",
    "img": "https://upload.wikimedia.org/wikipedia/commons/6/61/%27Salem%27s_Lot_%281975%29_front_cover%2C_first_edition.jpg",
    "wikipedia": "https://en.wikipedia.org/wiki/%27Salem%27s_Lot"
  },
  {
    "id": 13,
    "title": "Artemis",
    "description": "rtemis is a 2017 science fiction novel written by Andy Weir.[1] It takes place in the late 2080s in Artemis, the first and so far only city on the Moon. It follows the life of porter and smuggler Jasmine Jazz Bashara as she gets caught up in a conspiracy for control of the city.",
    "pages": 309,
    "published": "2017-11-14",
    "language": "English",
    "country": "United States",
    "img": "https://upload.wikimedia.org/wikipedia/en/6/68/Artemis-Andy_Weir_%282017%29.jpg",
    "wikipedia": "https://en.wikipedia.org/wiki/Artemis_(novel)"
  },
  {
    "id": 14,
    "title": "Starship Troopers",
    "description": "Starship Troopers is a military science fiction novel by American writer Robert A. Heinlein. Written in a few weeks in reaction to the US suspending nuclear tests,[5] the story was first published as a two-part serial in The Magazine of Fantasy & Science Fiction as Starship Soldier, and published as a book by G. P. Putnam's Sons on November 5, 1959.",
    "pages": 263,
    "published": "1959-11-5",
    "language": "English",
    "country": "United States",
    "img": "https://upload.wikimedia.org/wikipedia/en/a/a9/Starship_Troopers_%28novel%29.jpg",
    "wikipedia": "https://en.wikipedia.org/wiki/Starship_Troopers"
  },
  {
    "id": 15,
    "title": "One Hundred Years of Solitude",
    "description": "One Hundred Years of Solitude (Spanish: Cien años de soledad, Latin American Spanish: [sjen ˈaɲos ðe soleˈðað]) is a 1967 novel by Colombian author Gabriel García Márquez that tells the multi-generational story of the Buendía family, whose patriarch, José Arcadio Buendía, founded the fictitious town of Macondo. The novel is often cited as one of the supreme achievements in world literature.",
    "pages": 422,
    "published": "1967-1-1",
    "language": "Spanish",
    "country": "Argentina",
    "img": "https://upload.wikimedia.org/wikipedia/en/a/a0/Cien_a%C3%B1os_de_soledad_%28book_cover%2C_1967%29.jpg",
    "wikipedia": "https://en.wikipedia.org/wiki/One_Hundred_Years_of_Solitude"
  },
  {
    "id": 16,
    "title": "Dune",
    "description": "Dune is a 1965 epic science fiction novel by American author Frank Herbert, originally published as two separate serials in Analog magazine. It tied with Roger Zelazny's This Immortal for the Hugo Award in 1966 and it won the inaugural Nebula Award for Best Novel. It is the first installment of the Dune Chronicles. It is one of the world's best-selling science fiction novels.",
    "pages": 896,
    "published": "1965-8-1",
    "language": "English",
    "country": "United States",
    "img": "https://upload.wikimedia.org/wikipedia/en/d/de/Dune-Frank_Herbert_%281965%29_First_edition.jpg",
    "wikipedia": "https://en.wikipedia.org/wiki/Dune_(novel)"
  },
  {
    "id": 17,
    "title": "The Old Man and the Sea",
    "description": "The Old Man and the Sea is a 1952 novella written by the American author Ernest Hemingway. Written between December 1950 and February 1951, it tells the story of Santiago, an aging fisherman who catches a giant marlin after a long struggle, but then loses his bounty to sharks. The novella was highly anticipated and was released to record sales; the initial critical reception was equally positive, but attitudes have varied significantly since then.",
    "pages": 112,
    "published": "1952-9-1",
    "language": "English",
    "country": "United States",
    "img": "https://upload.wikimedia.org/wikipedia/en/7/73/Oldmansea.jpg",
    "wikipedia": "https://en.wikipedia.org/wiki/The_Old_Man_and_the_Sea"
  },
  {
    "id": 18,
    "title": "The Pillars of the Earth",
    "description": "The Pillars of the Earth is a historical novel by British author Ken Follett published in 1989 about the building of a cathedral in the fictional town of Kingsbridge, England. Set in the 12th century, the novel covers the time between the sinking of the White Ship and the murder of Thomas Becket, but focuses primarily on the Anarchy. The book traces the development of Gothic architecture out of the preceding Romanesque architecture, and the fortunes of the Kingsbridge priory and village against the backdrop of historical events of the time.",
    "pages": 806,
    "published": "1989-1-1",
    "language": "English",
    "country": "United Kingdom",
    "img": "https://upload.wikimedia.org/wikipedia/en/b/b3/PillarsOfTheEarth.jpg",
    "wikipedia": "https://en.wikipedia.org/wiki/The_Pillars_of_the_Earth"
  },
  {
    "id": 19,
    "title": "Mockingjay",
    "description": "Mockingjay is a 2010 dystopian young adult fiction novel by American author Suzanne Collins. It is chronologically the last installment of The Hunger Games series, following 2008's The Hunger Games and 2009's Catching Fire. The book continues the story of Katniss Everdeen, who agrees to unify the districts of Panem in a rebellion against the tyrannical Capitol.",
    "pages": 390,
    "published": "2010-8-24",
    "language": "English",
    "country": "United States",
    "img": "https://upload.wikimedia.org/wikipedia/en/c/cc/Mockingjay.JPG",
    "wikipedia": "https://en.wikipedia.org/wiki/Mockingjay"
  },
  {
    "id": 20,
    "title": "A Brief History of Time",
    "description": "A Brief History of Time: From the Big Bang to Black Holes is a book on theoretical cosmology by English physicist Stephen Hawking. It was first published in 1988. Hawking wrote the book for readers who had no prior knowledge of physics.",
    "pages": 256,
    "published": "1988-1-1",
    "language": "English",
    "country": "United Kingdom",
    "img": "https://upload.wikimedia.org/wikipedia/en/a/a3/BriefHistoryTime.jpg",
    "wikipedia": "https://en.wikipedia.org/wiki/A_Brief_History_of_Time"
  }
]