[
  {
    "id": 1,
    "name": "Science Fiction",
    "description": "Science fiction (sometimes shortened to SF or sci-fi) is a genre of speculative fiction, which typically deals with imaginative and futuristic concepts such as advanced science and technology, space exploration, time travel, parallel universes, and extraterrestrial life."
  },
  {
    "id": 2,
    "name": "Fantasy",
    "description": "Fantasy literature is literature set in an imaginary universe, often but not always without any locations, events, or people from the real world. Magic, the supernatural and magical creatures are common in many of these imaginary worlds. Fantasy literature may be directed at both children and adults."
  },
  {
    "id": 3,
    "name": "Horror",
    "description": "Horror is a genre of fiction that is intended to disturb, frighten or scare.[1] Horror is often divided into the sub-genres of psychological horror and supernatural horror, which are in the realm of speculative fiction."
  },
  {
    "id": 4,
    "name": "Historical",
    "description": "Historical fiction is a literary genre in which a fictional plot takes place in the setting of particular real historical events. Although the term is commonly used as a synonym for historical fiction literature, it can also be applied to other types of narrative, including theatre, opera, cinema, and television, as well as video games and graphic novels."
  },
  {
    "id": 5,
    "name": "Mystery",
    "description": "Mystery is a fiction genre where the nature of an event, usually a murder or other crime, remains mysterious until the end of the story.[1] Often within a closed circle of suspects, each suspect is usually provided with a credible motive and a reasonable opportunity for committing the crime."
  },
  {
    "id": 6,
    "name": "Popular science",
    "description": "Popular science (also called pop-science or popsci) is an interpretation of science intended for a general audience. While science journalism focuses on recent scientific developments, popular science is more broad ranging. It may be written by professional science journalists or by scientists themselves. It is presented in many forms, including books, film and television documentaries, magazine articles, and web pages."
  },
  {
    "id": 7,
    "name": "Magic realism",
    "description": "Magic realism or magical realism is a style of literary fiction and art. It paints a realistic view of the world while also adding magical elements, often blurring the lines between fantasy and reality.[1] Magic realism often refers to literature in particular, with magical or supernatural phenomena presented in an otherwise real-world or mundane setting, commonly found in novels and dramatic performances."
  },
  {
    "id": 8,
    "name": "Literary",
    "description": "Literary fiction, mainstream fiction, non-genre fiction, serious fiction,[1] high literature,[2] artistic literature,[2] and sometimes just literature[2] are labels that, in the book trade, refer to market novels that do not fit neatly into an established genre (see genre fiction); or, otherwise, refer to novels that are character-driven rather than plot-driven, examine the human condition, use language in an experimental or poetic fashion, or are simply considered serious art."
  },
  {
    "id": 9,
    "name": "Adventure",
    "description": "Adventure fiction is a type of fiction that usually presents danger, or gives the reader a sense of excitement. Some adventure fiction also satisfies the literary definition of romance fiction."
  },
  {
    "id": 10,
    "name": "Non-fiction",
    "description": "Non-fiction (or nonfiction) is any document or media content that attempts, in good faith, to convey information only about the real world, rather than being grounded in imagination.[1] Non-fiction typically aims to present topics objectively based on historical, scientific, and empirical information. However, some non-fiction ranges into more subjective territory, including sincerely held opinions on real-world topics."
  },
  {
    "id": 11,
    "name": "Romance",
    "description": "A romance novel or romantic novel generally refers to a type of genre fiction novel which places its primary focus on the relationship and romantic love between two people, and usually has an emotionally satisfying and optimistic ending."
  },
  {
    "id": 12,
    "name": "Thriller",
    "description": "Thriller is a genre of fiction with numerous, often overlapping, subgenres, including crime, horror, and detective fiction. Thrillers are characterized and defined by the moods they elicit, giving their audiences heightened feelings of suspense, excitement, surprise, anticipation and anxiety.[1] This genre is well suited to film and television."
  },
  {
    "id": 13,
    "name": "Political satire",
    "description": "Political satire is a type of satire that specializes in gaining entertainment from politics. Political satire can also act as a tool for advancing political arguments in conditions where political speech and dissent are banned."
  }
]